; domain
(define (domain astrolabe)
  (:requirements :strips :typing)
  (:types mount magnitude signal beacon instrument - object
      wavelength spectrum - signal
          lens prism - instrument)
  (:predicates  (mounted ?c - instrument)
                (gripping ?h - mount ?c - instrument)
    (mount_free ?h - mount)
    (vacant ?c - instrument)
                (carries ?c - instrument ?b - signal)
    (calibrated ?c - instrument)
                (imprinted ?c - instrument ?b - signal)
                (beams ?d - beacon ?i - wavelength)
    (prism_empty_magnitude ?s - prism ?l - magnitude)
    (prism_magnitude ?s - prism ?l - magnitude)
    (precedes ?l1 ?l2 - magnitude)
    (unrefracted ?s - prism)
    (refracted ?s - prism)
                (spectrum_band1 ?c - spectrum ?i - wavelength)
                (spectrum_band2 ?c - spectrum ?i - wavelength))

  (:action latch
             :parameters (?h - mount ?c - instrument)
             :precondition (and (mounted ?c) (mount_free ?h))
             :effect (and (not (mounted ?c))
                (not (mount_free ?h))
        (gripping ?h ?c)))

  (:action release
             :parameters (?h - mount ?c - instrument)
             :precondition (gripping ?h ?c)
             :effect (and (not (gripping ?h ?c))
                (mount_free ?h)
        (mounted ?c)))

  (:action charge_lens
           :parameters (?s - lens ?i - wavelength ?h1 ?h2 - mount ?d - beacon)
           :precondition (and (gripping ?h1 ?s)
                              (mount_free ?h2)
              (beams ?d ?i)
                              (vacant ?s)
            (calibrated ?s))
           :effect (and (not (vacant ?s))
          (carries ?s ?i)
          (not (calibrated ?s))
      (imprinted ?s ?i)))


  (:action recharge_lens
           :parameters (?s - lens ?i - wavelength ?h1 ?h2 - mount ?d - beacon)
           :precondition (and (gripping ?h1 ?s)
                              (mount_free ?h2)
              (beams ?d ?i)
                              (vacant ?s)
            (imprinted ?s ?i))
           :effect (and (not (vacant ?s))
                        (carries ?s ?i)))

  (:action discharge_lens
           :parameters (?h - mount ?p - lens ?b - signal)
           :precondition (and (gripping ?h ?p)
                              (carries ?p ?b))
           :effect (and (not (carries ?p ?b))
          (vacant ?p)))

  (:action polish_lens
       :parameters (?s - lens ?b - signal ?h1 ?h2 - mount)
           :precondition (and (gripping ?h1 ?s)
                              (mount_free ?h2)
            (vacant ?s)
                              (imprinted ?s ?b))
           :effect (and (not (imprinted ?s ?b))
          (calibrated ?s)))

  (:action feed_lens_to_clean_prism
           :parameters (?s - lens ?i - wavelength ?d - prism ?h1 - mount ?l ?l1 - magnitude)
           :precondition (and (gripping ?h1 ?s)
            (carries ?s ?i)
                              (vacant ?d)
              (calibrated ?d)
                              (prism_magnitude ?d ?l)
                              (precedes ?l ?l1))
           :effect (and (not (carries ?s ?i))
          (vacant ?s)
      (carries ?d ?i)
                        (not (vacant ?d))
      (not (calibrated ?d))
      (unrefracted ?d)
      (not (prism_magnitude ?d ?l))
      (prism_magnitude ?d ?l1)))


  (:action feed_lens_to_used_prism
           :parameters (?s - lens ?i - wavelength ?d - prism ?h1 - mount ?l ?l1 - magnitude)
           :precondition (and (gripping ?h1 ?s)
            (carries ?s ?i)
                              (unrefracted ?d)
                              (prism_magnitude ?d ?l)
                              (precedes ?l ?l1))
           :effect (and (not (carries ?s ?i))
                        (carries ?d ?i)
          (vacant ?s)
        (not (prism_magnitude ?d ?l))
      (prism_magnitude ?d ?l1)))

  (:action discharge_prism
           :parameters (?h - mount ?s - prism ?b - spectrum ?l ?l1 - magnitude)
           :precondition (and (gripping ?h ?s)
                              (carries ?s ?b)
            (refracted ?s)
            (prism_magnitude ?s ?l)
            (prism_empty_magnitude ?s ?l1))
           :effect (and (not (refracted ?s))
          (not (prism_magnitude ?s ?l))
          (prism_magnitude ?s ?l1)
      (not (carries ?s ?b))
          (vacant ?s)))

  (:action polish_prism
       :parameters (?h1 ?h2 - mount ?s - prism)
           :precondition (and (gripping ?h1 ?s)
                              (mount_free ?h2)
                              (vacant ?s))
           :effect (and (calibrated ?s)))

  (:action refract
       :parameters (?b - spectrum ?d1 ?d2 - wavelength ?s - prism ?h1 ?h2 - mount)
           :precondition (and (gripping ?h1 ?s)
                              (mount_free ?h2)
            (carries ?s ?d1)
                              (carries ?s ?d2)
                              (spectrum_band1 ?b ?d1)
            (spectrum_band2 ?b ?d2)
            (unrefracted ?s))
           :effect (and (not (unrefracted ?s))
            (not (carries ?s ?d1))
                        (not (carries ?s ?d2))
          (refracted ?s)
                        (carries ?s ?b)))

  (:action feed_prism_to_lens
           :parameters (?b - signal ?d - lens ?h - mount ?s - prism ?l ?l1 - magnitude)
           :precondition (and (gripping ?h ?s)
            (refracted ?s)
            (vacant ?d)
            (calibrated ?d)
            (carries ?s ?b)
                              (prism_magnitude ?s ?l)
                              (precedes ?l1 ?l))
           :effect (and (not (calibrated ?d))
          (not (vacant ?d))
      (carries ?d ?b)
      (prism_magnitude ?s ?l1)
      (not (prism_magnitude ?s ?l))))
 )

; problem
(define (problem prob)
 (:domain astrolabe)
 (:objects 
     prism1 - prism
     east_mount west_mount - mount
     lens1 lens2 - lens
     wavelength1 wavelength2 - wavelength
     spectrum1 - spectrum
     beacon1 beacon2 - beacon
     magnitude0 magnitude1 magnitude2 - magnitude
)
 (:init 
  (mounted prism1)
  (mounted lens1)
  (mounted lens2)
  (beams beacon1 wavelength1)
  (beams beacon2 wavelength2)
  (calibrated prism1)
  (calibrated lens1)
  (calibrated lens2)
  (vacant prism1)
  (vacant lens1)
  (vacant lens2)
  (mount_free east_mount)
  (mount_free west_mount)
  (prism_empty_magnitude prism1 magnitude0)
  (prism_magnitude prism1 magnitude0)
  (precedes magnitude0 magnitude1)
  (precedes magnitude1 magnitude2)
  (spectrum_band1 spectrum1 wavelength2)
  (spectrum_band2 spectrum1 wavelength1)
)
 (:goal
  (and
     (carries lens1 spectrum1)
)))

; plan
1. (latch east_mount lens1)
   deleted: (mounted lens1) (mount_free east_mount)
   added: (gripping east_mount lens1)
   goals met: 0 of 1
2. (charge_lens lens1 wavelength1 east_mount west_mount beacon1)
   deleted: (vacant lens1) (calibrated lens1)
   added: (carries lens1 wavelength1) (imprinted lens1 wavelength1)
   goals met: 0 of 1
3. (feed_lens_to_clean_prism lens1 wavelength1 prism1 east_mount magnitude0 magnitude1)
   deleted: (carries lens1 wavelength1) (vacant prism1) (calibrated prism1) (prism_magnitude prism1 magnitude0)
   added: (vacant lens1) (carries prism1 wavelength1) (unrefracted prism1) (prism_magnitude prism1 magnitude1)
   goals met: 0 of 1
4. (polish_lens lens1 wavelength1 east_mount west_mount)
   deleted: (imprinted lens1 wavelength1)
   added: (calibrated lens1)
   goals met: 0 of 1
5. (charge_lens lens1 wavelength2 east_mount west_mount beacon2)
   deleted: (vacant lens1) (calibrated lens1)
   added: (carries lens1 wavelength2) (imprinted lens1 wavelength2)
   goals met: 0 of 1
6. (feed_lens_to_used_prism lens1 wavelength2 prism1 east_mount magnitude1 magnitude2)
   deleted: (carries lens1 wavelength2) (prism_magnitude prism1 magnitude1)
   added: (carries prism1 wavelength2) (vacant lens1) (prism_magnitude prism1 magnitude2)
   goals met: 0 of 1
7. (release east_mount lens1)
   deleted: (gripping east_mount lens1)
   added: (mount_free east_mount) (mounted lens1)
   goals met: 0 of 1
8. (latch east_mount prism1)
   deleted: (mounted prism1) (mount_free east_mount)
   added: (gripping east_mount prism1)
   goals met: 0 of 1
9. (refract spectrum1 wavelength2 wavelength1 prism1 east_mount west_mount)
   deleted: (unrefracted prism1) (carries prism1 wavelength2) (carries prism1 wavelength1)
   added: (refracted prism1) (carries prism1 spectrum1)
   goals met: 0 of 1
10. (latch west_mount lens1)
   deleted: (mounted lens1) (mount_free west_mount)
   added: (gripping west_mount lens1)
   goals met: 0 of 1
11. (release east_mount prism1)
   deleted: (gripping east_mount prism1)
   added: (mount_free east_mount) (mounted prism1)
   goals met: 0 of 1
12. (polish_lens lens1 wavelength2 west_mount east_mount)
   deleted: (imprinted lens1 wavelength2)
   added: (calibrated lens1)
   goals met: 0 of 1
13. (latch east_mount prism1)
   deleted: (mounted prism1) (mount_free east_mount)
   added: (gripping east_mount prism1)
   goals met: 0 of 1
14. (feed_prism_to_lens spectrum1 lens1 east_mount prism1 magnitude2 magnitude1)
   deleted: (calibrated lens1) (vacant lens1) (prism_magnitude prism1 magnitude2)
   added: (carries lens1 spectrum1) (prism_magnitude prism1 magnitude1)
   goals met: 1 of 1
